/*++----------------------------------------------------------------------------------------------------------------------------------------------------------------------
1. 项目名称：AggregatorAPP (一个典型的Aggregator应用系统)
2. 文件名：src -> configs -> cors.js
3. 作者：zhaohuagang@lifang.com
4. 备注：跨域白名单配置，主要用于向外提供restful接口
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------++*/
export default {
    "dev" : "*" ,
    "test" : "*" ,
    "sim" : "*" ,
    "prod" : [
        "http://www.wkzf.com" ,
        "http://hr.wkzf.com" ,
        "http://localhost" ,
        "http://www.express.me"
    ]
} ;