/*++----------------------------------------------------------------------------------------------------------------------------------------------------------------------
1. 项目名称：AggregatorAPP (一个典型的Aggregator应用系统)
2. 文件名：src -> configs -> app.js
3. 作者：tangxuyang@lifang.com
4. 备注：整个应用的一些全局配置项，适用于那些零散的配置项，如数据库配置等一项多参数的配置就专门用一个配置文件来处理
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------++*/
module.exports = {
    "version" : "1.0" ,  //这个版本号将跟着项目管理规定的版本号走
    "viewEnginee" : "ejs"   //应用系统使用的模板引擎，可以是：ejs | jade | hbs，当然前提条件是npm install了相应模板引擎模块
} ;