/*++----------------------------------------------------------------------------------------------------------------------------------------------------------------------
1. 项目名称：AggregatorAPP (一个典型的Aggregator应用系统)
2. 文件名：src -> configs -> interface.js
3. 作者：tangxuyang@lifang.com
4. 备注：由于很多应用只是把数据接口当做model层，而不是直接接触数据库，本文件提供数据接口配置
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------++*/
module.exports = {
    "prefix" : {
        "dev" : "http://dev.hr.wkzf.com" ,
        "test" : "http://test.hr.wkzf.com" ,
        "sim" : "http://sim.hr.wkzf.com" ,
        "prod" : "http://hr.wkzf.com" 
    } ,
    "suffix" : { //后缀代表接口去掉prefix的部分，这里可以是无限级的树状结构，根据自己的需要
        "agent" : {

        }
    }
} ;