/*++----------------------------------------------------------------------------------------------------------------------------------------------------------------------
1. 项目名称：AggregatorAPP (一个典型的Aggregator应用系统)
2. 文件名：src -> configs -> soa.js
3. 作者：tangxuyang@lifang.com
4. 备注：soa相关请求配置
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------++*/
module.exports = {
    "timeout" : 60 * 1000 ,  //超时请求时间，单位：毫秒
    "successCode" : 1 ,  //restfulAPI返回的状态码status多少代表成功
    "sessionExpireCode" : 1502 ,  //restfulAPI返回的状态码status多少代表session失效
    "ssl" : [  //ssl证书清单
        "ca.crt"
    ]
} ;